{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 500], "input_dtype": "float32", "sparse": false, "name": "inp_nodes"}, "inbound_nodes": [], "name": "inp_nodes"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "output_dim": 40, "activity_regularizer": null, "trainable": true, "init": "glorot_normal", "bias": true, "input_dtype": "float32", "input_dim": 500, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "batch_input_shape": [null, 500]}, "inbound_nodes": [[["inp_nodes", 0, 0]]], "name": "dense_1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 171], "input_dtype": "int64", "sparse": false, "name": "inp_rel"}, "inbound_nodes": [], "name": "inp_rel"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 2, 171], "input_dtype": "float32", "sparse": false, "name": "inp_rel_mask"}, "inbound_nodes": [], "name": "inp_rel_mask"}, {"class_name": "GraphDense", "config": {"W_constraint": null, "b_constraint": null, "name": "graphdense_1", "output_dim": 40, "activity_regularizer": null, "trainable": true, "n_rel": 2, "b_regularizer": null, "init": "glorot_normal", "bias": true, "input_dtype": "float32", "input_dim": 40, "batch_input_shape": [null, 40], "W_regularizer": null, "activation": "relu", "mean": 3}, "inbound_nodes": [[["dense_1", 0, 0], ["inp_rel", 0, 0], ["inp_rel_mask", 0, 0]]], "name": "graphdense_1"}, {"class_name": "GraphDense", "config": {"W_constraint": null, "b_constraint": null, "name": "graphdense_2", "output_dim": 40, "activity_regularizer": null, "trainable": true, "n_rel": 2, "b_regularizer": null, "init": "glorot_normal", "bias": true, "input_dtype": "float32", "input_dim": 40, "batch_input_shape": [null, 40], "W_regularizer": null, "activation": "relu", "mean": 3}, "inbound_nodes": [[["graphdense_1", 0, 0], ["inp_rel", 0, 0], ["inp_rel_mask", 0, 0]]], "name": "graphdense_2"}, {"class_name": "GraphDense", "config": {"W_constraint": null, "b_constraint": null, "name": "graphdense_3", "output_dim": 40, "activity_regularizer": null, "trainable": true, "n_rel": 2, "b_regularizer": null, "init": "glorot_normal", "bias": true, "input_dtype": "float32", "input_dim": 40, "batch_input_shape": [null, 40], "W_regularizer": null, "activation": "relu", "mean": 3}, "inbound_nodes": [[["graphdense_2", 0, 0], ["inp_rel", 0, 0], ["inp_rel_mask", 0, 0]]], "name": "graphdense_3"}, {"class_name": "GraphDense", "config": {"W_constraint": null, "b_constraint": null, "name": "graphdense_4", "output_dim": 40, "activity_regularizer": null, "trainable": true, "n_rel": 2, "b_regularizer": null, "init": "glorot_normal", "bias": true, "input_dtype": "float32", "input_dim": 40, "batch_input_shape": [null, 40], "W_regularizer": null, "activation": "relu", "mean": 3}, "inbound_nodes": [[["graphdense_3", 0, 0], ["inp_rel", 0, 0], ["inp_rel_mask", 0, 0]]], "name": "graphdense_4"}, {"class_name": "GraphDense", "config": {"W_constraint": null, "b_constraint": null, "name": "graphdense_5", "output_dim": 40, "activity_regularizer": null, "trainable": true, "n_rel": 2, "b_regularizer": null, "init": "glorot_normal", "bias": true, "input_dtype": "float32", "input_dim": 40, "batch_input_shape": [null, 40], "W_regularizer": null, "activation": "relu", "mean": 3}, "inbound_nodes": [[["graphdense_4", 0, 0], ["inp_rel", 0, 0], ["inp_rel_mask", 0, 0]]], "name": "graphdense_5"}, {"class_name": "GraphDense", "config": {"W_constraint": null, "b_constraint": null, "name": "graphdense_6", "output_dim": 40, "activity_regularizer": null, "trainable": true, "n_rel": 2, "b_regularizer": null, "init": "glorot_normal", "bias": true, "input_dtype": "float32", "input_dim": 40, "batch_input_shape": [null, 40], "W_regularizer": null, "activation": "relu", "mean": 3}, "inbound_nodes": [[["graphdense_5", 0, 0], ["inp_rel", 0, 0], ["inp_rel_mask", 0, 0]]], "name": "graphdense_6"}, {"class_name": "GraphDense", "config": {"W_constraint": null, "b_constraint": null, "name": "graphdense_7", "output_dim": 40, "activity_regularizer": null, "trainable": true, "n_rel": 2, "b_regularizer": null, "init": "glorot_normal", "bias": true, "input_dtype": "float32", "input_dim": 40, "batch_input_shape": [null, 40], "W_regularizer": null, "activation": "relu", "mean": 3}, "inbound_nodes": [[["graphdense_6", 0, 0], ["inp_rel", 0, 0], ["inp_rel_mask", 0, 0]]], "name": "graphdense_7"}, {"class_name": "GraphDense", "config": {"W_constraint": null, "b_constraint": null, "name": "graphdense_8", "output_dim": 40, "activity_regularizer": null, "trainable": true, "n_rel": 2, "b_regularizer": null, "init": "glorot_normal", "bias": true, "input_dtype": "float32", "input_dim": 40, "batch_input_shape": [null, 40], "W_regularizer": null, "activation": "relu", "mean": 3}, "inbound_nodes": [[["graphdense_7", 0, 0], ["inp_rel", 0, 0], ["inp_rel_mask", 0, 0]]], "name": "graphdense_8"}, {"class_name": "GraphDense", "config": {"W_constraint": null, "b_constraint": null, "name": "graphdense_9", "output_dim": 40, "activity_regularizer": null, "trainable": true, "n_rel": 2, "b_regularizer": null, "init": "glorot_normal", "bias": true, "input_dtype": "float32", "input_dim": 40, "batch_input_shape": [null, 40], "W_regularizer": null, "activation": "relu", "mean": 3}, "inbound_nodes": [[["graphdense_8", 0, 0], ["inp_rel", 0, 0], ["inp_rel_mask", 0, 0]]], "name": "graphdense_9"}, {"class_name": "GraphDense", "config": {"W_constraint": null, "b_constraint": null, "name": "graphdense_10", "output_dim": 40, "activity_regularizer": null, "trainable": true, "n_rel": 2, "b_regularizer": null, "init": "glorot_normal", "bias": true, "input_dtype": "float32", "input_dim": 40, "batch_input_shape": [null, 40], "W_regularizer": null, "activation": "relu", "mean": 3}, "inbound_nodes": [[["graphdense_9", 0, 0], ["inp_rel", 0, 0], ["inp_rel_mask", 0, 0]]], "name": "graphdense_10"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "output_dim": 3, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 40, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "batch_input_shape": [null, 40]}, "inbound_nodes": [[["graphdense_10", 0, 0]]], "name": "dense_2"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["dense_2", 0, 0]]], "name": "activation_1"}], "input_layers": [["inp_nodes", 0, 0], ["inp_rel", 0, 0], ["inp_rel_mask", 0, 0]], "output_layers": [["activation_1", 0, 0]], "name": "model_1"}}